PANS_py/phase_average/triPrism_LES_filter_mesh/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    Inlet 
    {
      type               zeroGradient; //inletOutlet;
      //inletValue         $internalField;
    }

    Outlet
    {
      type               fixedValue; //totalPressure;
      //rho		 none;
      //p0		 $internalField;
      value		 $internalField;
    }


    Side
    {
        type             empty;
    }

    Prism
    {
        type             zeroGradient;
    }
    topWall
    {
        type             zeroGradient;
    }
    botWall
    {
        type             zeroGradient;
    }
}


// ************************************************************************* //
