PANS_py/phase_average/triPrism_LES_filter_mesh/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.7535676727191694;
walls 		uniform 1e-8;

boundaryField
{
    Inlet
    {
	type        	fixedValue;
    	value       	$internalField;
    }

    Outlet
    {
      type              zeroGradient;
    }


    Side
    {
        type            empty;
    }

    Prism
    {
        type            kqRWallFunction;
        value           $walls; //$internalField;
    }
    topWall
    {
        type            kqRWallFunction;
        value           $walls; //$internalField;
    }
    botWall
    {
        type            kqRWallFunction;
        value           $walls; //$internalField;
    }
}

// ************************************************************************* //
