PANS_py/phase_average/triPrism_LES_filter_mesh/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.003993935464691358;
wall 		uniform 1e-9;

boundaryField
{
    Inlet
    {
      type             fixedValue; 
      value       $internalField;
    }

    Outlet
    {
      type             zeroGradient;
    }


    Side
    {
        type           empty;
    }

    Prism
    {
       type            nutUWallFunction;
       value           $wall;
    }
    topWall
    {
       type            nutUWallFunction; //nutUSpaldingWallFunction
       value           $wall;
    }
    botWall
    {
       type            nutUWallFunction; //nutUSpaldingWallFunction
       value           $wall;
    }
}


// ************************************************************************* //
