PANS_py/phase_average/triPrism_LES_filter_mesh/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 188.67797924656836;
walls 		uniform 1e6;
boundaryField
{
    Inlet
    {
      type            fixedValue;
      value           $internalField;
    }

    Outlet
    {
      type            fixedValue;
      value           $internalField * 100;
    }


    Side
    {
        type            empty;
    }

    Prism
    {
        type            omegaWallFunction;
        value           $walls;
    }
    topWall
    {
        type            omegaWallFunction;
        value           $walls;
    }
    botWall
    {
        type            omegaWallFunction;
        value           $walls;
    }
}


// ************************************************************************* //
